<?php
    if(isset($_POST['city'])){
        $city = $_POST['city'];
    }
    if(isset($_POST['d_id'])){
        $d_id = $_POST['d_id'];
    }
    $opt = array();
    $taipei = [0=>"松山區", 1=>"信義區", 2=>"大安區", 3=>"中山區", 4=>"中正區", 5=>"大同區", 6=>"萬華區", 7=>"文山區", 8=>"南港區", 9=>"內湖區", 10=>"士林區", 
                11=>"北投區"];
    $newtp = [0=>"板橋區", 1=>"三重區", 2=>"中和區", 3=>"永和區", 4=>"新莊區", 5=>"新店區", 6=>"樹林區", 7=>"鶯歌區", 8=>"三峽區", 9=>"淡水區", 10=>"瑞芳區", 
                11=>"汐止區", 12=>"土城區", 13=>"蘆洲區", 14=>"五股區", 15=>"泰山區", 16=>"林口區", 17=>"深坑區", 18=>"石碇區", 19=>"坪林區",
                20=>"三芝區", 21=>"石門區", 22=>"八里區", 23=>"雙溪區", 24=>"貢寮區", 25=>"金山區", 26=>"萬里區", 27=>"烏來區"];
    $yilan = [0=>"三星鄉",1=>"大同鄉",2=>"五結鄉",3=>"冬山鄉",4=>"狀園鄉",5=>"宜蘭市",6=>"南澳鄉",7=>"員山鄉",8=>"頭城鎮",9=>"礁溪鄉",10=>"羅東鎮"];
    $hualien = [0=>"玉里鎮",1=>"光復鄉",2=>"吉安鄉",3=>"秀林鄉",4=>"卓溪鄉",5=>"花蓮市",6=>"富里鄉",7=>"新城鄉",8=>"瑞穗鄉",9=>"萬榮鄉",10=>"壽豐鄉",
                11=>"鳳林鎮",12=>"豐濱鄉"];
    $jinmen = [0=>"金沙鎮",1=>"金城鎮",2=>"金湖鎮",3=>"金寧鄉",4=>"烈嶼鄉"];
    $nantou = [0=>"中寮鄉",1=>"仁愛鄉",2=>"水里鄉",3=>"名間鄉",4=>"竹山鎮",5=>"信義鄉",6=>"南投市",7=>"埔里鎮",8=>"草屯鎮",9=>"國姓鄉",10=>"魚池鄉",
                11=>"鹿谷鄉"];
    $pingtung = [0=>"九如鄉",1=>"三地門",2=>"內埔鄉",3=>"竹田鄉",4=>"牡丹鄉",5=>"車城鄉",6=>"里港鄉",7=>"佳冬鄉",8=>"來義鄉",9=>"東港鎮",10=>"枋山鄉",
                11=>"枋寮鄉",12=>"林邊鄉",13=>"長治鄉",14=>"長治鄉",15=>"南州鄉",16=>"屏東市",17=>"恆春鎮",18=>"春日鄉",19=>"崁頂鄉",20=>"泰武鄉",
                21=>"琉球鄉",22=>"高樹鄉",23=>"新埤鄉",24=>"新園鄉",25=>"獅子鄉",26=>"萬丹鄉",27=>"萬巒鄉",28=>"滿州鄉",29=>"瑪家鄉",30=>"潮州鎮",
                31=>"霧台鄉",32=>"麟洛鄉",33=>"鹽埔鄉"];
    $miaoli = [0=>"三義鄉",1=>"大湖鄉",2=>"公館鄉",3=>"竹南鎮",4=>"西湖鄉",5=>"卓蘭鎮",6=>"南庄鄉",7=>"後龍陣",8=>"苑裡鎮",9=>"苗栗市",10=>"通霄鎮",
                11=>"造橋鄉",12=>"獅潭鄉",13=>"銅鑼鄉",14=>"頭份市",15=>"頭屋鄉"];
    $taoyuan = [0=>"八德區",1=>"大園區",2=>"大溪區",3=>"中壢區",4=>"平鎮區",5=>"桃園區",6=>"龍潭區",7=>"楊梅區",8=>"新屋區",9=>"龜山區",10=>"觀音區",
                11=>"復興區",12=>"大園區",13=>"蘆竹區"];
    $hsinchu = [0=>"新竹市",1=>"竹北市",2=>"湖口鄉",3=>"新豐鄉",4=>"新埔鎮",5=>"關西鎮",6=>"橫山鄉",7=>"五峰鄉",8=>"竹東鎮",9=>"寶山鄉",10=>"芎林鄉",
                11=>"尖石鄉",12=>"北埔鄉",13=>"峨眉鄉"];
    $taichung = [0=>"中區",1=>"東區",2=>"南區",3=>"西區",4=>"北區",5=>"北屯區",6=>"西屯區",7=>"南屯區",8=>"太平區",9=>"大里區",10=>"霧峰區",
                11=>"烏日區",12=>"豐原區",13=>"后里區",14=>"石岡區",15=>"東勢區",16=>"和平區",17=>"新社區",18=>"潭子區",19=>"大雅區",20=>"神岡區",
                21=>"大肚區",22=>"沙鹿區",23=>"龍井區",24=>"梧棲區",25=>"清水區",26=>"大甲區",27=>"外埔區",28=>"大安區"];
    $chunghua = [0=>"彰化市",1=>"芬園鄉",2=>"花壇鄉",3=>"秀水鄉",4=>"鹿港鎮",5=>"福興鄉",6=>"線西鄉",7=>"和美鎮",8=>"伸港鄉",9=>"員林市",
                10=>"社頭鄉",11=>"永靖鄉",12=>"埔心鄉",13=>"溪湖鎮",14=>"大村鄉",15=>"埔鹽鄉",16=>"田中鎮",17=>"北斗鎮",18=>"田尾鄉",19=>"埤頭鄉",
                20=>"溪州鄉",21=>"竹塘鄉",22=>"二林鎮",23=>"大城鄉",24=>"芳苑鄉",25=>"二水鄉"];
    $yunlin = [0=>"斗南鎮",1=>"大埤鄉",2=>"虎尾鎮",3=>"土庫鎮",4=>"褒忠鄉",5=>"東勢鄉",6=>"臺西鄉",7=>"崙背鄉",8=>"麥寮鄉",9=>"斗六市",
                10=>"林內鄉",11=>"古坑鄉",12=>"莿桐鄉",13=>"西螺鎮",14=>"二崙鄉",15=>"北港鎮",16=>"水林鄉",17=>"口湖鄉",18=>"四湖鄉",19=>"元長鄉"];
    $chiayi = [0=>"嘉義市",1=>"番路鄉",2=>"梅山鄉",3=>"竹崎鄉",4=>"阿里山鄉",5=>"中埔鄉",6=>"大埔鄉",7=>"水上鄉",8=>"鹿草鄉",9=>"太保市",10=>"朴子市",
                11=>"東石鄉",12=>"六腳鄉",13=>"新港鄉",14=>"民雄鄉",15=>"大林鎮",16=>"溪口鄉",17=>"義竹鄉",18=>"布袋鎮"];
    $tainan = [0=>"中區",1=>"東區",2=>"南區",3=>"西區",4=>"北區",5=>"安平區",6=>"安南區",7=>"永康區",8=>"歸仁區",9=>"新化區",
                10=>"左鎮區",11=>"玉井區",12=>"楠西區",13=>"南化區",14=>"仁德區",15=>"關廟區",16=>"龍崎區",17=>"官田區",18=>"麻豆區",19=>"佳里區",
                20=>"西港區",21=>"七股區",22=>"將軍區",23=>"學甲區",24=>"北門區",25=>"新營區",26=>"後壁區",27=>"白河區",28=>"東山區",29=>"六甲區",
                30=>"下營區",31=>"柳營區",32=>"鹽水區",33=>"善化區",34=>"大內區",35=>"山上區",36=>"新市區",37=>"安定區"];
    $kaohsiung = [0=>"新興區",1=>"前金區",2=>"苓雅區",3=>"鹽埕區",4=>"鼓山區",5=>"旗津區",6=>"前鎮區",7=>"三民區",8=>"楠梓區",9=>"小港區",
                    10=>"左營區",11=>"仁武區",12=>"大社區",13=>"岡山區",14=>"路竹區",15=>"阿蓮區",16=>"田寮區",17=>"燕巢區",18=>"橋頭區",19=>"梓官區",
                    20=>"彌陀區",21=>"永安區",22=>"湖內區",23=>"鳳山區",24=>"大寮區",25=>"林園區",26=>"鳥松區",27=>"大樹區",28=>"旗山區",29=>"美濃區",
                    30=>"六龜區",31=>"內門區",32=>"杉林區",33=>"甲仙區",34=>"桃源區",35=>"三民區",36=>"茂林區",37=>"茄萣區"];
    $taitung = [0=>"台東市",1=>"綠島鄉",2=>"蘭嶼鄉",3=>"延平鄉",4=>"卑南鄉",5=>"鹿野鄉",6=>"關山鎮",7=>"海瑞鄉",8=>"池上鄉",9=>"東河鄉",
                10=>"成功鎮",11=>"長濱鄉",12=>"太麻里鄉",13=>"金峰鄉",14=>"大武鄉",15=>"達仁鄉"];
    $penghu = [0=>"馬公市",1=>"西嶼鄉",2=>"望安鄉",3=>"七美鄉",4=>"白沙鄉",5=>"湖西鄉"];
    $lianjiang = [0=>"南竿鄉",1=>"北竿鄉",2=>"莒光鄉",3=>"東引鄉"];
    $keelung = [0=>"仁愛區",1=>"信義區",2=>"中正區",3=>"中山區",4=>"安樂區",5=>"暖暖區",6=>"七堵區"];

    if($city == "臺北市"){ $opt = $taipei; }
    else if($city == "新北市"){ $opt = $newtp; }
    else if($city == "桃園市"){ $opt = $taoyuan;}
    else if($city == "台中市"){ $opt = $taichung;}
    else if($city == "台南市"){ $opt = $tainan;}
    else if($city == "高雄市"){ $opt = $kaohsiung;}
    else if($city == "基隆市"){ $opt = $keelung;}
    else if($city == "新竹市"){ $opt = $hsinchu;}
    else if($city == "苗栗縣"){ $opt = $miaoli;}
    else if($city == "彰化縣"){ $opt = $chunghua;}
    else if($city == "南投縣"){ $opt = $nantou;}
    else if($city == "雲林縣"){ $opt = $yunlin;}
    else if($city == "嘉義縣"){ $opt = $chiayi;}
    else if($city == "屏東縣"){ $opt = $pingtung;}
    else if($city == "宜蘭縣"){ $opt = $yilan;}
    else if($city == "花蓮縣"){ $opt = $hualien;}
    else if($city == "台東縣"){ $opt = $taitung;}
    else if($city == "澎湖縣"){ $opt = $penghu;}
    else if($city == "金門縣"){ $opt = $jinmen;}
    else if($city == "連江縣"){ $opt = $lianjiang;}
?>

<!DOCTYPE html>
<html lang="zh-TW">
<head>
<title>醫貳參</title>
<meta charset="UTF-8">

<meta name="viewport" content="width=device-width, initial-scale=1">        <!--到mobile裝置上仍可正常顯示,指定螢幕寬度為裝置寬度,畫面載入初始縮放比例 100% -->
<link href="https://cdn.jsdelivr.net/npm/bootstrap@5.1.1/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-F3w7mX95PdgyTmZZMECAngseQB83DfGTowi0iMjiWaeVhAn4FJkqJByhZMI3AhiU" crossorigin="anonymous">
<link rel="stylesheet" href="/page_css/location.css">

</head>
<body>
<div class="row">
    <div class="container-fluid">
        <nav class="navbar fixed-top navbar-dark" style="background-color: #2F4F4F;">
        <div class="container-fluid">
            <a class="navbar-brand" href="#">醫貳參</a>
        </div>
        </nav>
    </div>
</div>

<div class="content-box">
    <h2>請填入位置資訊，若是不確定詳細地址也可以使用附近地標查詢!</h2>
</div>

<form action = "show.php" method = "post">
    <input type='hidden' name='d_id' value="<?php echo $d_id;?>">
    <div class="container">

        <div class="row">
        <div class="input-group input-group-lg mb-3">
                <label class="input-group-text" for="town">鄉鎮市區</label>
                <select class="form-select" id="city" name="town">
                    <option selected>請選擇所在鄉鎮市區...</option>
                    <?php
                        foreach($opt as $option):;
                    ?>
                    <option value="<?php echo $city.$option;?>"><?php echo $option;?></option>
                    <?php
                        endforeach;
                    ?>
                </select>
            </div>
        </div>

    </div>

    <div class="container-xl">

        <div class="row">
            <div class="input-group input-group-lg">
                <span class="input-group-text" id="addr">位置資訊</span>
                <input type="text" class="form-control" aria-label="Large input group" aria-describedby="input-group-lg" name="addr">
            </div>
        </div>
    </div>
    <div class="container">
        <div class="row">
            <input type="submit" value="確認送出"><!--按下這個送出按鈕就可以把文字送到後端-->
        </div>
    </div>
</form>
</html>